; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	satellite6 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite7 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	infrared0 - mode
	image1 - mode
	Star1 - direction
	Star4 - direction
	GroundStation3 - direction
	GroundStation0 - direction
	GroundStation2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(supports instrument1 infrared0)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument2 image1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon5)
	(supports instrument3 image1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star4)
	(supports instrument5 infrared0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
	(supports instrument6 image1)
	(calibration_target instrument6 Star4)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon9)
	(supports instrument7 infrared0)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation2)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon9)
	(supports instrument8 infrared0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 infrared0)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star1)
	(supports instrument10 infrared0)
	(calibration_target instrument10 Star4)
	(supports instrument11 infrared0)
	(supports instrument11 image1)
	(calibration_target instrument11 Star4)
	(on_board instrument10 satellite6)
	(on_board instrument11 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Planet8)
	(supports instrument12 image1)
	(supports instrument12 infrared0)
	(calibration_target instrument12 GroundStation3)
	(supports instrument13 image1)
	(supports instrument13 infrared0)
	(calibration_target instrument13 GroundStation0)
	(supports instrument14 image1)
	(supports instrument14 infrared0)
	(calibration_target instrument14 GroundStation2)
	(on_board instrument12 satellite7)
	(on_board instrument13 satellite7)
	(on_board instrument14 satellite7)
	(power_avail satellite7)
	(pointing satellite7 GroundStation2)
)
(:goal (and
	(pointing satellite3 Planet6)
	(pointing satellite5 GroundStation3)
	(have_image Phenomenon5 image1)
	(have_image Planet6 image1)
	(have_image Phenomenon7 infrared0)
	(have_image Planet8 image1)
	(have_image Phenomenon9 image1)
	(have_image Planet10 infrared0)
))

)

; plan
1. (switch_on instrument14 satellite7)
   deleted: (power_avail satellite7)
   added: (power_on instrument14)
   goals met: 0 of 8
2. (calibrate satellite7 instrument14 groundstation2)
   added: (calibrated instrument14)
   goals met: 0 of 8
3. (turn_to satellite7 planet10 groundstation2)
   deleted: (pointing satellite7 groundstation2)
   added: (pointing satellite7 planet10)
   goals met: 0 of 8
4. (take_image satellite7 planet10 instrument14 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 1 of 8
5. (turn_to satellite7 phenomenon9 planet10)
   deleted: (pointing satellite7 planet10)
   added: (pointing satellite7 phenomenon9)
   goals met: 1 of 8
6. (take_image satellite7 phenomenon9 instrument14 image1)
   added: (have_image phenomenon9 image1)
   goals met: 2 of 8
7. (turn_to satellite7 phenomenon7 phenomenon9)
   deleted: (pointing satellite7 phenomenon9)
   added: (pointing satellite7 phenomenon7)
   goals met: 2 of 8
8. (take_image satellite7 phenomenon7 instrument14 infrared0)
   added: (have_image phenomenon7 infrared0)
   goals met: 3 of 8
9. (turn_to satellite7 phenomenon5 phenomenon7)
   deleted: (pointing satellite7 phenomenon7)
   added: (pointing satellite7 phenomenon5)
   goals met: 3 of 8
10. (turn_to satellite3 planet6 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 planet6)
   goals met: 4 of 8
11. (take_image satellite7 phenomenon5 instrument14 image1)
   added: (have_image phenomenon5 image1)
   goals met: 5 of 8
12. (turn_to satellite5 groundstation3 star1)
   deleted: (pointing satellite5 star1)
   added: (pointing satellite5 groundstation3)
   goals met: 6 of 8
13. (turn_to satellite7 planet6 phenomenon5)
   deleted: (pointing satellite7 phenomenon5)
   added: (pointing satellite7 planet6)
   goals met: 6 of 8
14. (take_image satellite7 planet6 instrument14 image1)
   added: (have_image planet6 image1)
   goals met: 7 of 8
15. (turn_to satellite7 planet8 planet6)
   deleted: (pointing satellite7 planet6)
   added: (pointing satellite7 planet8)
   goals met: 7 of 8
16. (take_image satellite7 planet8 instrument14 image1)
   added: (have_image planet8 image1)
   goals met: 8 of 8
